Revit 2026 API

# ElectricityFailures Properties

---

The BuiltInFailuresElectricityFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyMismatchCircuitDisconnected | The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit? |
|  | InvalidPoleNumber | The panel is single phase [wire] wires. The number of poles can not be larger than [value]. |
|  | InvalidPoleNumberInIsolatedPanel | The panel is an isolated panel. The number of poles should equal to [value]. |
|  | InvalidSpareLoad | The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again. |

#### Reference

BuiltInFailuresElectricityFailures Class

Autodesk.Revit.DB Namespace